/********************************************************************************
 * Copyright (C) 2005-2026, Suzhou Tongyuan Software&Control Technology Co.,Ltd.
 * All rights reserved.
 * 版权所有 (C) 2005-2026， 苏州同元软控技术股份有限公司
 * 保留所有权利。
 *
 * 该文件由MWORKS内核代码生成器自动生成。
 *
 * 文件名称: mwb_runtime.h
 * 生成时间: 2026-07-16 23:05:45
 *
********************************************************************************/

#ifndef MWB_RUNTIME_SRC_H
#define MWB_RUNTIME_SRC_H

#define MwbUnlikely(b) (b)
#define MwbLikely(b) (b)


#endif  /* MWB_RUNTIME_SRC_H */

/********************************************************************************
** end of file
********************************************************************************/
