using TyControlSystems
using TyBase
##【示例13】化简求系统的传递函数
# 定义各模块模型 
G1 = tf([1], [1, 1])
G2 = tf([1], [3, 4, 1])
G3 = tf([1], [1, 0])
# 计算loop1 
loop1 = parallel(G1, G2)
# 计算loop2 
loop2 = feedback(loop1 * G3, 1)

#-----------------------------------------#

##【示例14】给定一个多回路控制系统的方块图，对其进行化简求解传递函数
# 定义各模块模型 
G1 = tf([2], [1, 8])
G2 = tf([1, 0, 4], [1, 0, -4, 1])
G3 = tf([1], [1, 2])
G4 = tf([1], [1, 0])
H1 = tf([2, -3], [1, 8, 0, 10])
H2 = tf([1, 3], [1, 8])
H3 = tf([1], [1, 1])
# 有内到外计算各回路模型 
loop1 = feedback(G3 * G4, H1)
loop2 = feedback(G2 * loop1, H2 / G4)
loop3 = feedback(G1 * loop2, H3)

#-----------------------------------------#

##【示例15】对于给定模型的化简G(s)=(5s^3+50s^2+155s+150)/(s^4+11s^3+41^s2+61s+30)
G = tf([5, 50, 155, 150], [1, 11, 41, 61, 30])
GTrans = zpk(G) #从零极点模型发现，系统在 𝑠=−2、−3、−5 处有近似相同的零极点。在数学上就可以直接进行对消
# 系统的最小实现
Gr = minreal(G)

#-----------------------------------------#

##【示例16】5阶双输入双输出系统的最小实现
# 系统矩阵定义
A = [-6 -1.5 2 4 9.5; -6 -2.5 2 5 12.5; -5 0.25 -0.5 3.5 9.75; -1 0.5 0 -1 1.5; -2 -1 1 2 3]
B = [6 4; 5 5; 3 4; 0 2; 3 1]
C = [2 0.75 -0.5 -1.5 -2.75; 0 -1.25 1.5 1.5 2.25]
D = zeros(2, 2)
# 系统创建
G = ss(A, B, C, D)
# 通过minreal函数求取系统最小实现
Gr = minreal(G)
#原系统与最小实现系统的阶跃响应对比
step(Gr, 0:0.3:20, "--ro", markersize=4, linewidth=0.5)
step(G, 20, "-b", ishold=true, linewidth=1)
grid("on")

#-----------------------------------------#

##【示例17】模型简化处理
## 1.将上述模型先进行一个均衡状态空间实现
G = tf([1, 11, 36, 26], [1, 14.6, 74.96, 153.7, 99.65])
# 均衡状态空间模型实现
Gb, g = balreal(ss(G))

## 2.通过modred()函数从均衡实现中消除对系统影响较小的状态
# 消除影响较小的两个状态
Gdel = modred(Gb, [3, 4], method=:Truncate)

## 原始系统与降阶系统的频率特性对比
w = logspace(-2, 2, 50)
bode(Gdel, w, "--or", markersize=5, linewidth=1.5)
bode(Gdel, w, "-b", linewidth=0.75, ishold=true)
bodegrid(true)
legend(["Gdel-降阶系统", "G-原系统"])
