using TyCurveFitting
#数据导入
time = [0.1; 0.1; 0.3; 0.3; 1.3; 1.7; 2.1; 2.6; 3.9; 3.9; 5.1; 5.6; 6.2; 6.4; 7.7; 8.1; 8.2; 8.9; 9.0; 9.5; 9.6; 10.2; 10.3; 10.8; 11.2; 11.2; 11.2; 11.7; 12.1; 12.3; 12.3; 13.1; 13.2; 13.4; 13.7; 14.0; 14.3; 15.4; 16.1; 16.1; 16.4; 16.4; 16.7; 16.7; 17.5; 17.6; 18.1; 18.5; 19.3; 19.7];
conc = [0.01; 0.08; 0.13; 0.16; 0.55; 0.90; 1.11; 1.62; 1.79; 1.59; 1.83; 1.68; 2.09; 2.17; 2.66; 2.08; 2.26; 1.65; 1.70; 2.39; 2.08; 2.02; 1.65; 1.96; 1.91; 1.30; 1.62; 1.57; 1.32; 1.56; 1.36; 1.05; 1.29; 1.32; 1.20; 1.10; 0.88; 0.63; 0.69; 0.69; 0.49; 0.53; 0.42; 0.48; 0.41; 0.27; 0.36; 0.33; 0.17; 0.20];
#自定义模型拟合
f = fit("c*a*b*x^(b-1)*exp(-a*x^b)", time, conc, startpt=[0.01, 2, 5])
plotfit(f, time, conc)


#拟合优度
d = f.s_data


#曲线绘制
subplot(2, 1, 1)
hold("on")
#绘制原有数据
plot(time, conc, "b.");
#绘制三次多项式拟合曲线
plotfit(f, "r-");
hold("off")
legend(["原有数据", "自定义模型拟合"], loc="northeast")
#计算拟合值
time1 = 18:0.1:22
concfortune = f(time1)
ci, = predint(f, time1; level=0.95, intv="o")
subplot(2, 1, 2)
hold("on")
#误差条绘制
h3 = errorbar(time1, concfortune, concfortune - ci[:, 1], ci[:, 2] - concfortune, fmt="-");
#原有曲线绘制
plot(time, conc, "b.");
#拟合曲线
plotfit(f, "g--");
legend(["原有数据", "自定义模型拟合"]; loc="northeast")
hold("off")

