# 创建向量 [1,2,3]
x = [1, 2, 3]
# 创建 2x3 的矩阵
x = [1 2 3;
  4 5 6]


x = [1, 2, 3, 4, 5]
# 取第 1 个元素
x[1] # 1  
# 取最后一个（第 5 个）元素
x[end] # 5 
# 取第 2 个到第 4 个元素
x[2:4] # [2, 3, 4]
# 取第 2 个到最后一个元素
x[2:end] # [2, 3, 4, 5]


x = [1, 2, 3, 4, 5, 6]
# 取偶数位的元素
x[2:2:end] # [2, 4, 6]
# 数组翻转，也可使用 reverse(x)
x[end:-1:1] # [6, 5, 4, 3, 2, 1]


A = [1 2 3; 4 5 6]
vec(A) # [1,4,2,5,3,6]

A = [1 2 3; 4 5 6]
# 线性索引取第 3 个元素
# 按列主序方向遍历
A[3] # 2
# 取矩阵的第 2 行
A[2, :] # [4, 5, 6]



A = [1 2 3; 4 5 6]
# 创建新的数组，修改 B 不会影响 A
B = A[1, :]
B[1] = 100
# 创建视图，修改 C, A 也会被修改
C = @view A[1, :]
C[1] = 100
#=
A = [100 2 3;
 4 5 6]
=#



A = [1 2 3; 4 5 6]
# 每个元素都增加 1
A .+ 1 # [2 3 4; 5 6 7]
# 第 1,2,3 列分别乘以 1,2,3
A .* [1 2 3] # [1 4 9; 4 10 18]
# 和 1 维向量广播时
# 1 维向量扩展为 nx1 的矩阵
# 第 1,2 行分别减去 1,2
A .- [1, 2] # [0 1 2; 2 3 4]



A = [1 2; 3 4]
B = [0 1; 1 0]
# 矩阵乘法
A * B
# [2 1;
# 4 3]



A = [1.0+1.0im 2.0+1.0im;
  4.0+1.0im 5.0+1.0im]
# 转置
transpose(A)
permutedims(A)
# [1.0+1.0im 4.0+1.0im;
# 2.0+1.0im 5.0+1.0im]
# 共轭转置
A'
adjoint(A)
# [1.0-1.0im 4.0-1.0im;
# 2.0-1.0im 5.0-1.0im]





x = [1.0 2.0 3.0;
  4.0 5.0 6.0]
# 垂直拼接
[x; ones(1, 3)]
vcat(x, ones(1, 3))
# [1. 2. 3.;
# 4. 5. 6.;
# 1. 1. 1.]

# 水平拼接
[x ones(2, 1)]
hcat(x, ones(2, 1))
# [1. 2. 3. 1.;
# 4. 5. 6. 1.]